In [6]:
import pandas as pd
import numpy as np
import pymongo

In [2]:
allstar_db = pd.read_csv("../data/AllstarFull.csv")

In [20]:
allstar_db.head()

    playerID  yearID  gameNum        gameID teamID lgID   GP  startingPos
0  gomezle01    1933        0  ALS193307060    NYA   AL  1.0          1.0
1  ferreri01    1933        0  ALS193307060    BOS   AL  1.0          2.0
2  gehrilo01    1933        0  ALS193307060    NYA   AL  1.0          3.0
3  gehrich01    1933        0  ALS193307060    DET   AL  1.0          4.0
4  dykesji01    1933        0  ALS193307060    CHA   AL  1.0          5.0

In [4]:
teams_db = pd.read_csv("../data/Teams.csv")

In [26]:
teams_db = teams_db[['yearID', 'teamID', 'W', 'L', 'WSWin']]
teams_db = teams_db.rename(columns={'yearID':'year', 'teamID':'team', 'W':'Wins', 'L':'Losses', 'WSWin': 'Championship'})

In [27]:
teams_db.tail()

      year team  Wins  Losses Championship
2800  2015  LAN    92      70            N
2801  2015  SFN    84      78            N
2802  2015  ARI    79      83            N
2803  2015  SDN    74      88            N
2804  2015  COL    68      94            N

In [42]:
salaries_db = pd.read_csv("../data/Salaries.csv")

In [44]:
salaries_db.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [45]:
salaries_db = salaries_db[['yearID', 'teamID', 'salary']]
salaries_db = salaries_db.rename(columns={'yearID': 'year', 'teamID':'team'})

In [48]:
salaries_group = salaries_db.groupby(['year', 'team'])
salaries_group = salaries_group['salary'].sum()

In [49]:
salaries_group.head()

year  team
1985  ATL     14807000
      BAL     11560712
      BOS     10897560
      CAL     14427894
      CHA      9846178
Name: salary, dtype: int64